# Libraries

In [1]:
import pandas as pd
import numpy as np
from datetime import date

# Data Import
### PALMS

In [2]:
year = 2016
month = "03"

df_palms_test = pd.read_csv(f"data/palms_report_data_{year}_{month}.csv", index_col=0, encoding="ISO-8859-1")
columns_list = df_palms_test.columns.tolist()
columns_list = columns_list[-2:] + columns_list[:-2]
df_palms_test = df_palms_test[columns_list]
df_palms_test["palms_date"] = date(year, int(month), 1)
df_palms_test.head(10)

,user_ID,chapter_ID,P,A,L,M,S,RGI,RGO,RRI,RRO,V,1-2-1,TYFCB,CEU,palms_date
0,733,1,3,0,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
1,1150,1,3,0,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
2,414,1,3,0,0,0,0,0,0,0,0,0,2,0,0,2016-03-01
3,1721,1,3,0,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
4,1919,1,4,0,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
5,631,1,3,1,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
6,2260,1,2,1,0,0,0,0,0,0,0,0,3,0,0,2016-03-01
7,313,1,2,1,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
8,1267,1,3,0,0,0,0,0,0,0,0,0,5,0,0,2016-03-01
9,1870,1,3,1,0,0,0,0,0,0,0,0,0,0,0,2016-03-01

In [3]:
start_year = 2016
start_month = 2
n_files = 60

df_palms = pd.DataFrame()

for i in range(n_files):
    month = (start_month + i) % 12 + 1
    month = str(month)
    if len(month) == 1:
        month = "0" + month
    else:
        pass
    year = start_year + ((start_month + i) // 12)
#     print(f"region-palms-report_{year}_{month}.csv")
    
    df_temp = pd.read_csv(f"data/palms_report_data_{year}_{month}.csv", index_col=0, encoding="ISO-8859-1")
    df_temp["palms_date"] = date(year, int(month), 1)

    df_palms = pd.concat([df_palms, df_temp])

column_list = df_palms.columns.tolist()
column_list = column_list[-3:-1] + column_list[:-3] + [column_list[-1]]
df_palms = df_palms[column_list]

df_palms.reset_index(inplace=True, drop=True)
df_palms

,user_ID,chapter_ID,P,A,L,M,S,RGI,RGO,RRI,RRO,V,1-2-1,TYFCB,CEU,palms_date
0,733,1,3,0,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
1,1150,1,3,0,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
2,414,1,3,0,0,0,0,0,0,0,0,0,2,0,0,2016-03-01
3,1721,1,3,0,0,0,0,0,0,0,0,0,0,0,0,2016-03-01
4,1919,1,4,0,0,0,0,0,0,0,0,0,1,0,0,2016-03-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29211,2875,31,4,0,0,0,0,5,4,11,7,1,1,3913,2,2021-02-01
29212,276,31,4,0,0,0,0,3,2,1,0,0,3,4214,8,2021-02-01
29213,585,31,3,1,0,0,0,8,1,2,6,0,7,73,0,2021-02-01
29214,1223,31,3,1,0,0,0,2,4,7,1,0,10,1755,4,2021-02-01
29215,2917,31,3,0,0,0,0,0,0,0,1,0,1,0,0,2021-02-01

### database

In [4]:
df_database = pd.read_csv("data/database_data.csv", index_col=0, encoding="ISO-8859-1")
column_list = df_database.columns.tolist()

# don't use "chapter_ID" column - duplicate information
column_list = column_list[-3:-2] + column_list[:-3] + [column_list[-1]]
df_database = df_database[column_list]
df_database.head(10)

,user_ID,Profession,Position,Join Date,Renewal Date,sponsor_ID
0,982,"Medical, Chiropractor",NaN,01/07/2004,01/12/2010,NaN
1,860,"Trades, Renovations-Remodeling",NaN,01/02/2008,01/12/2008,NaN
2,1970,"Food/Beverages, Chef",NaN,01/09/2010,01/12/2011,NaN
3,898,"Gifts, Gift Baskets",NaN,01/03/2007,07/04/2008,898.0
4,2204,"Mortgage, Mortgage Broker",NaN,01/07/2007,01/07/2008,NaN
5,1465,"Real estate services, Residential Real Estate ...",NaN,01/07/2007,01/04/2021,NaN
6,2377,"Insurance, Life,Health and Disability Insurance",NaN,01/07/2007,01/11/2009,NaN
7,2214,"Financial, Investment Advisor",NaN,01/07/2007,01/04/2009,NaN
8,832,"Health & Wellness, Massage Therapist",NaN,01/07/2007,01/07/2008,NaN
9,715,"Insurance, General-Motor Insurance",NaN,01/10/2007,01/10/2008,898.0

In [5]:
df_database.rename(columns={"Profession": "profession",
                            "Position": "position",
                            "Join Date": "join_date",
                            "Renewal Date": "renewal_date",}, 
                   inplace=True)


df_database["join_date"] = pd.to_datetime(df_database["join_date"], format='%d/%m/%Y', errors='coerce')
df_database["renewal_date"] = pd.to_datetime(df_database["renewal_date"], format='%d/%m/%Y', errors='coerce')
df_database.tail()

,user_ID,profession,position,join_date,renewal_date,sponsor_ID
3389,2265,"Construction, Builder/General Contractor",NaN,2021-03-01,2022-03-01,2512.0
3390,2736,"Legal & Accounting, Real Estate Law",NaN,2021-02-01,2022-02-01,NaN
3391,1827,"Construction, Electrician",NaN,2021-02-01,2022-02-01,2419.0
3392,257,"Finance & Insurance, Life,Health and Disabilit...",NaN,2021-03-01,2022-03-01,1369.0
3393,132,"Finance & Insurance, Residential Mortgages",NaN,2021-03-01,2022-03-01,NaN

### dropped_members

In [6]:
df_dropped_members = pd.read_csv("data/dropped_members_data.csv", index_col=0, encoding="ISO-8859-1")
column_list = df_dropped_members.columns.tolist()
column_list = column_list[-2:-1] + column_list[:-2]
df_dropped_members = df_dropped_members[column_list]

df_dropped_members.drop(["Date/Time"], axis=1, inplace=True)

df_dropped_members.rename(columns={"Effective Drop Date": "drop_date",
                                   "Reason": "drop_reason",
                                   "Drop Type": "drop_type"}, 
                          inplace=True)
df_dropped_members.head(10)

   user_ID   drop_date                      drop_reason drop_type
0   1936.0  11/01/2021              Takes Too Much Time  Resigned
1   1546.0  24/02/2021                 Personal Reasons  Resigned
2   1622.0  05/02/2021         Other Reason (see notes)  Resigned
3   2598.0  16/02/2021         Other Reason (see notes)  Resigned
4   2760.0  16/02/2021  Member Transferred BNI Chapters  Resigned
5   1178.0  11/02/2021         Other Reason (see notes)  Resigned
6   2699.0  09/02/2021                No Reason Entered  Resigned
7   2474.0  01/02/2021  Member Transferred BNI Chapters  Resigned
8   2462.0  31/01/2021                 Personal Reasons  Resigned
9   1479.0  01/12/2020                              NaN    System

In [7]:
df_dropped_members.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2093 entries, 0 to 2092
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   user_ID      2077 non-null   float64
 1   drop_date    2093 non-null   object
 2   drop_reason  1216 non-null   object
 3   drop_type    2093 non-null   object
dtypes: float64(1), object(3)
memory usage: 81.8+ KB

In [8]:
df_dropped_members[df_dropped_members["user_ID"].isna()]

      user_ID   drop_date drop_reason drop_type
1299      NaN  16/03/2015         NaN       Yes
1395      NaN  25/08/2014         NaN       Yes
1418      NaN  15/07/2014         NaN       Yes
1437      NaN  27/05/2014         NaN       Yes
1440      NaN  21/05/2014         NaN       Yes
1676      NaN  09/10/2012         NaN       Yes
1833      NaN  22/10/2011         NaN       Yes
1834      NaN  22/10/2011         NaN       Yes
1835      NaN  22/10/2011         NaN       Yes
1863      NaN  15/08/2011         NaN       Yes
1864      NaN  15/08/2011         NaN       Yes
1865      NaN  15/08/2011         NaN       Yes
1876      NaN  20/07/2011         NaN       Yes
1879      NaN  19/07/2011         NaN       Yes
1881      NaN  13/07/2011         NaN       Yes
2002      NaN  06/01/2010         NaN       Yes

Seems like there are some missing values in ```user_ID``` column. They are all, however, listed from a time period before the PALMS data that is being looked into, so those records can be dropped.

In [9]:
df_dropped_members = df_dropped_members[~df_dropped_members["user_ID"].isna()]
df_dropped_members.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2077 entries, 0 to 2092
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   user_ID      2077 non-null   float64
 1   drop_date    2077 non-null   object
 2   drop_reason  1216 non-null   object
 3   drop_type    2077 non-null   object
dtypes: float64(1), object(3)
memory usage: 81.1+ KB

In [10]:
df_dropped_members["drop_date"] = pd.to_datetime(df_dropped_members["drop_date"], format='%d/%m/%Y', errors='coerce')
df_dropped_members["user_ID"] = pd.to_numeric(df_dropped_members["user_ID"], downcast='integer')
df_dropped_members.head()

   user_ID  drop_date                      drop_reason drop_type
0     1936 2021-01-11              Takes Too Much Time  Resigned
1     1546 2021-02-24                 Personal Reasons  Resigned
2     1622 2021-02-05         Other Reason (see notes)  Resigned
3     2598 2021-02-16         Other Reason (see notes)  Resigned
4     2760 2021-02-16  Member Transferred BNI Chapters  Resigned

### Joined data

In [89]:
df_master = df_palms.copy()
df_master = df_master.merge(df_database, how="left", on="user_ID")
df_master = df_master.merge(df_dropped_members, how="left", on="user_ID")
df_master.drop(["drop_reason", "drop_type", "position", "sponsor_ID"], axis=1, inplace=True)
df_master.sample(10, random_state=13)

,user_ID,chapter_ID,P,A,L,M,S,RGI,RGO,RRI,RRO,V,1-2-1,TYFCB,CEU,palms_date,profession,join_date,renewal_date,drop_date
5068,1226,1,3,0,0,0,0,0,3,0,3,0,2,178,1,2016-10-01,"Financial, Investment Advisor",2016-04-01,2017-10-01,NaT
15797,2547,25,3,0,0,0,2,0,0,1,0,0,1,4838,1,2017-11-01,"Real Estate, Real Estate Sales Representative ...",2014-05-01,2016-06-01,2018-01-18
42547,840,25,1,0,0,0,0,0,0,0,0,0,0,0,0,2020-09-01,"Security, Security Services",2020-09-01,2021-02-01,2019-10-04
16824,1448,9,4,0,0,0,0,2,4,1,2,2,10,0,40,2018-01-01,"Information Technology, Design Web",2017-11-01,2018-11-01,2019-11-01
21369,1311,30,4,0,0,0,0,0,8,0,1,1,10,3952,7,2018-06-01,"Financial, Investment Advisor",2017-04-01,2020-04-01,2020-03-19
43444,2184,5,4,0,0,0,0,5,18,3,6,0,24,25437,4,2020-11-01,"Trades, General Contractor",2018-09-01,2019-09-01,2018-09-12
26955,2911,31,4,0,0,0,1,3,3,1,3,0,8,7329,0,2019-01-01,"Trades, Renovations - Exterior",2017-06-01,2019-06-01,2017-04-01
23692,1004,30,4,0,0,0,0,4,10,1,1,1,6,1518,4,2018-09-01,"Real estate services, Residential Real Estate ...",2015-12-01,2021-12-01,NaT
535,818,24,5,0,0,0,0,3,0,2,6,0,6,80,0,2016-03-01,"Marketing, Digital Marketing",2015-12-01,2018-09-01,2018-05-23
5404,82,16,4,0,0,0,0,3,0,0,1,0,4,1319,11,2016-10-01,"Alternative Medicine, Nutritionist",2013-09-01,2017-09-01,2017-04-17

In [90]:
df_master.shape

(46412, 20)

# Aggregate 3-month data
### Work with small dataset to get a better grasp

In [129]:
df_single = df_master.copy()
df_single["palms_date"] = pd.to_datetime(df_single["palms_date"], errors='coerce')
df_single["renewal_date"] = pd.to_datetime(df_single["renewal_date"], errors='coerce')

df_single["membership_length"] = (df_single["palms_date"] - df_single["join_date"])/np.timedelta64(1, 'M')
df_single["membership_length"] = df_single["membership_length"].round().astype(int) // 12
df_single["months_to_renewal"] = (df_single["renewal_date"] - df_single["palms_date"])/np.timedelta64(1, 'M')
df_single["months_to_renewal"] = df_single["months_to_renewal"].round().astype(int)
df_single["years_to_renewal"] = df_single["months_to_renewal"] // 12
df_single["months_to_renewal"] = df_single["months_to_renewal"] % 12

for index, row in df_single.iterrows():
    df_single.at[index, 'renewal_date'] = row['renewal_date'] - pd.DateOffset(years=row['years_to_renewal'])
    
df_single = df_single.loc[(df_single["months_to_renewal"] <= 6) & (df_single["months_to_renewal"] >= 4)]

df_single.drop(["years_to_renewal", "months_to_renewal"], axis=1, inplace=True)

df_single = df_single

df_single.head()

,user_ID,chapter_ID,P,A,L,M,S,RGI,RGO,RRI,...,V,1-2-1,TYFCB,CEU,palms_date,profession,join_date,renewal_date,drop_date,membership_length
8,313,1,2,1,0,0,0,0,0,0,...,0,1,0,0,2016-03-01,"Health & Wellness, Gym",2016-04-01,2016-09-01,NaT,-1
16,920,1,4,0,0,0,0,0,0,0,...,0,5,0,14,2016-03-01,"Coach, Business Coach",2017-08-01,2016-08-01,2018-04-06,-2
17,920,1,4,0,0,0,0,0,0,0,...,0,5,0,14,2016-03-01,"Coach, Business Coach",2017-08-01,2016-08-01,2017-08-02,-2
28,207,3,5,0,0,0,0,0,0,0,...,0,3,0,0,2016-03-01,"Accounting, Accountant",2016-03-01,2016-09-01,NaT,0
38,1224,3,3,1,0,0,0,0,0,0,...,0,1,0,3,2016-03-01,"Photography, Photographer",2016-03-01,2016-09-01,NaT,0

In [130]:
# group by "renewal_date"
# The rest of the columns listed in groupby remain the same for the given time period.
test = df_single.groupby(["renewal_date", "user_ID", "chapter_ID", "profession", "membership_length"]).sum()
test.reset_index(level=["user_ID", "chapter_ID", "profession", "membership_length"], inplace=True)
test.head()

,user_ID,chapter_ID,profession,membership_length,P,A,L,M,S,RGI,RGO,RRI,RRO,V,1-2-1,TYFCB,CEU
renewal_date,,,,,,,,,,,,,,,,,
2016-07-01,113,18,"Educational, Personal Tutor",0,0,2,0,0,0,0,0,0,1,0,0,0,0
2016-07-01,416,17,"Information Technology, I.T. Specialist",0,1,4,0,0,0,0,0,3,0,0,2,250,2
2016-07-01,420,8,"Finance & Insurance, Financial Advisor/Financi...",17,4,1,0,0,0,1,1,0,0,0,1,3195,1
2016-07-01,438,9,"Health & Wellness, Certified Holistic Nutritio...",1,5,0,0,0,0,3,2,1,3,0,5,3720,3
2016-07-01,441,17,"Travel, Travel Agent",0,4,0,0,0,1,1,0,0,2,0,5,0,0

In [125]:
test.loc[test["user_ID"] == 420]

,user_ID,chapter_ID,profession,membership_length,P,A,L,M,S,RGI,RGO,RRI,RRO,V,1-2-1,TYFCB,CEU
renewal_date,,,,,,,,,,,,,,,,,
2016-07-01,420,8,"Finance & Insurance, Financial Advisor/Financi...",17,4,1,0,0,0,1,1,0,0,0,1,3195,1
2017-07-01,420,8,"Finance & Insurance, Financial Advisor/Financi...",18,9,1,0,0,3,1,2,2,1,0,16,7421,3
2018-07-01,420,8,"Finance & Insurance, Financial Advisor/Financi...",19,11,1,0,0,0,9,8,1,8,1,15,21651,23
2019-07-01,420,8,"Finance & Insurance, Financial Advisor/Financi...",20,9,1,0,0,2,1,8,1,18,1,7,3734,11
2020-07-01,420,8,"Finance & Insurance, Financial Advisor/Financi...",21,11,0,0,0,0,2,14,0,8,1,7,1796,14
2021-07-01,420,8,"Finance & Insurance, Financial Advisor/Financi...",22,7,0,0,0,0,2,11,2,7,1,9,3891,11

In [128]:
df_database[["user_ID", "join_date"]]

      user_ID  join_date
0         982 2004-07-01
1         860 2008-02-01
2        1970 2010-09-01
3         898 2007-03-01
4        2204 2007-07-01
...       ...        ...
3389     2265 2021-03-01
3390     2736 2021-02-01
3391     1827 2021-02-01
3392      257 2021-03-01
3393      132 2021-03-01

[3394 rows x 2 columns]